NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_socket.c
#include "esp32s2_socket.h"
#include "esp32s2_buzzer.h"
#include "esp32s2_wifi.h"
#include "esp32s2_buff_operations.h"
#include "esp32s2_24lc512.h"
#include "esp32s2_gpio.h"
#include "esp32s2_main.h"
#include "esp32s2_task.h"
#include "string.h"
#include "esp32s2_fatal_err.h"

#define TAG "sockets"
#define TCPServerIP "192.168.1.12"
#define TCPClientIP "192.168.1.12"
#define PORT 5000
#define MAX_COUNT_TO_WAIT 110
#define USE_KEEP_ALIVE 1
#define MAX_SOCKET_FAIL_CNT 3

#define HACK_FOR_WINDOWS_TOOL 1
#define MAX_ALLOWED_OPEN_SOCKETS 5

uint16_t client_socket_id[MAX_ALLOWED_OPEN_SOCKETS];

extern uint8_t access_point;

/* Server details */
uint8_t https_password[SERV_IP_LEN];
uint8_t ap_ssid_buff[AP_SSID_LEN];
uint8_t ap_psw_buff[AP_PSW_LEN];
uint16_t server_port_address;

uint8_t config_calib_auth = 0;
uint32_t config_calib_ses_id;
uint32_t config_calib_ses_res;
uint8_t client_con_id, config_calib_mode;

uint8_t socket_client_status = 0;

uint8_t recv_buf[RECV_BUFF_SIZE], recv_buf_head = 0, recv_buf_tail = 0;
uint8_t signalled_to_stop_server = 0;
uint8_t ready_to_be_exited = 0;
uint8_t tcp_server_is_alive = 0;

uint8_t stream_rx_buff[UART_STREAM_RX_BUFF_SIZE];
uint8_t stream_tx_buff[UART_STREAM_TX_BUFF_SIZE];
uint8_t uart_cmd, uart_arg1;
uint16_t total_req_len;

int sock;
static int client_socket = 0;//client socket
static int master_socket = 0; 
int r;

extern uint8_t exit_server_task;

extern TaskHandle_t serverTask_handle;
extern TaskHandle_t clientTask_handle;


uint32_t turt_fm_hw_ver = ((HW_VERSION << 8) | (FW_VERSION));

/*
 * @Info:   Clear the receive buffer and close the socket;
 * @Param:  None
 * @Return: None
 */
void close_socket(void) {
    if(tcp_server_is_alive) {
        ESP_LOGI(TAG,"Closing the socket");
        uint16_t max_wait_cnt = 0;
        signalled_to_stop_server = 1;
        vTaskDelay(1000/portTICK_PERIOD_MS);
        bzero(recv_buf, sizeof(recv_buf));
        while(!ready_to_be_exited) { // Wait till gets signalled from tcp server
            vTaskDelay(100/portTICK_PERIOD_MS);
            if(max_wait_cnt++ >= MAX_COUNT_TO_WAIT) {
                break;
            }
        }
        shutdown(master_socket, 0);
        close(master_socket);
        master_socket = -1;
        vTaskDelay(1000/portTICK_PERIOD_MS);
    }
}

void deleteConfigCalibTask(void) {
    close_socket();
    signalled_to_stop_server = 0;
    ready_to_be_exited = 0;
    vTaskDelay(5);
    ESP_LOGI(TAG,"Stopping DHCP server");
    stop_dhcp_server();
    vTaskDelay(5);
    ESP_LOGI(TAG,"Stopping WiFi AP");
    esp_wifi_stop();
    vTaskDelay(5);
    extern uint8_t stopBatteryOverVoltageProtectionOnCalibration;
    stopBatteryOverVoltageProtectionOnCalibration = 0;
    if (config_calib_mode == CONFIG_CALIB_WIFI_SERVER) {
        if (serverTask_handle != NULL) {
            vTaskDelete(serverTask_handle);
            serverTask_handle = NULL;
            tcp_server_is_alive = 0;
            ESP_LOGI(TAG, "...tcp_server task deleted...");
        }
    } else {
        if (clientTask_handle != NULL) {
            vTaskDelete(clientTask_handle);
            clientTask_handle = NULL;
            ESP_LOGI(TAG, "...tcp_client task deleted...");
        }
    }
}

/*
 * @Info:  TCP client task; Socket allocation, binding, data receive;
 * @Param:  void task handler
 * @Return: None
 */
void tcp_client(void *pvParam) {
    config_calib_mode = CONFIG_CALIB_WIFI_CLIENT;
    ESP_LOGI(TAG, "tcp_client task started");
    struct sockaddr_in tcpServerAddr;
    tcpServerAddr.sin_addr.s_addr = inet_addr(TCPServerIP);
    tcpServerAddr.sin_family = AF_INET;
    tcpServerAddr.sin_port = htons(PORT);
    int r;
    sock = socket(AF_INET, SOCK_STREAM, 0);
    while (1) {
        if (xSemaphoreTake(connectionSemaphore, 10000 / portTICK_RATE_MS)) {
            while (1) {
                switch (socket_client_status) {
                    case idle:
                        sock = socket(AF_INET, SOCK_STREAM, 0);
                        if (sock < 0) {
                            ESP_LOGE(TAG, "... Failed to allocate socket...");
                            vTaskDelay(1000 / portTICK_PERIOD_MS);
                        } else {
                            ESP_LOGE(TAG, "... Allocated socket...");
                            socket_client_status = allocated_socket;
                        }
                        break;
                    case allocated_socket:
                        if (connect(sock, (struct sockaddr *) &tcpServerAddr, sizeof(tcpServerAddr)) != 0) {
                            socket_client_status = idle;
                            ESP_LOGE(TAG, "... socket connect failed errno=%d ...", errno);
                            close(sock);
                            vTaskDelay(5000 / portTICK_PERIOD_MS);
                        } else {
                            ESP_LOGI(TAG, "Connected to server");

                            for (int i = 0; i < 30; i++) {
                                stream_tx_buff[i] = i;
                            }
                            int err = send(sock, stream_tx_buff, 30, 0);
                            if (err < 0) {
                                ESP_LOGE(TAG, "Error occurred during sending: errno %d", errno);
                            }
                            socket_client_status = connected_socket;
                            blink(led_magenta_color, FULL_ON);
                        }
                        break;
                    case connected_socket:
                        bzero(recv_buf, sizeof(recv_buf));
                        r = read(sock, recv_buf, sizeof(recv_buf) - 1);
                        if (r < 0) {
                            ESP_LOGI(TAG, "Socket closed");
                            socket_client_status = allocated_socket;
                        } else {
                            ESP_LOGI(TAG, "Checking data");
                            if (read_calib_config_req(&uart_cmd, stream_tx_buff, &total_req_len)) {
                                socket_client_status = data_received;
                                ESP_LOGI(TAG, "Data received");
                                extern uint8_t configuration_timeout_cnt;
                                configuration_timeout_cnt = 0;
                            }
                        }
                        break;
                    case data_received:
                        process_labview_cmd();
                        socket_client_status = connected_socket;
                        break;
                }
            }
        } else {
            extern uint8_t server_connect_retry_cnt;
            extern uint8_t server_connect_retry;
            if (server_connect_retry_cnt > 15) {
                server_connect_retry_cnt = 0;
                server_connect_retry += 1;
                esp_wifi_stop();
                ESP_LOGI(TAG, "Retrying connecting to E24by7");
                play_tone1();
                connectSTA("E24by7", "Energy24by7");
            }
            if (server_connect_retry >= 3) {
                server_connect_retry = 0;
                server_connect_retry_cnt = 0;
                set_algo_status(0);
                extern uint16_t watchdog_timer_stop;
                watchdog_timer_stop = 0;
                ESP_LOGI(TAG, "...tcp_client task deleted...");
                esp_wifi_stop();
                vTaskDelete(NULL);
            }

