NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_socket.c
        }
    }
}

/*
 * @Info:  TCP server task; Socket allocation, binding, data receive;
 * @Param:  void task handler
 * @Return: None
 */
void tcp_server(void *pvParam) {
    extern uint8_t configuration_timeout_cnt;
    configuration_timeout_cnt = 0;
    config_calib_mode = CONFIG_CALIB_WIFI_SERVER;
    ESP_LOGI(TAG, "tcp_server task started \n");
    struct sockaddr_in tcpServerAddr;
    memset(&tcpServerAddr,0,sizeof(tcpServerAddr));
    tcpServerAddr.sin_addr.s_addr = htonl(INADDR_ANY);
    tcpServerAddr.sin_family = AF_INET;
    tcpServerAddr.sin_port = htons(5000);
    struct sockaddr_in remote_addr;
    memset(&remote_addr,0,sizeof(remote_addr));
    unsigned int socklen;
    socklen = sizeof(remote_addr);
    socket_client_status = idle;

    //set of socket descriptors
    fd_set readfds;
    int max_sd,sd,valread = 0;
    int activity = 0;
    BaseType_t xTrueValue = pdTRUE;
    uint8_t bind_fail_cnt = 0;
    uint8_t listen_fail_cnt = 0;
    uint8_t select_err_cnt = 0;
    static uint8_t open_socket_cnt = 0;
    uint8_t i = 0;


#if USE_KEEP_ALIVE
    int keepAlive = 1;
    int keepIdle = 5;
    int keepInterval = 5;
    int keepCount = 3;
#endif
    
    master_socket = 0;
    client_socket = 0;
    ESP_LOGI(TAG, "TCP Server starting");

    master_socket = socket(AF_INET, SOCK_STREAM, 0);
    if (master_socket < 0) {
        ESP_LOGE(TAG, "Failed to allocate socket: %d Error: %s", master_socket, strerror(errno));
    } else {
        socket_client_status = allocated_socket;
    }

    blink(led_magenta_color, FULL_ON);
    while (1) {
        if (xSemaphoreTake(serverSemaphore, 10000 / portTICK_RATE_MS)) {
            ESP_LOGI(TAG, "Entering TCP server function");
            while (1) {
                tcp_server_is_alive = 1;
                if(!signalled_to_stop_server) {
                    switch (socket_client_status) {
                        case idle:
                            master_socket = socket(AF_INET, SOCK_STREAM, 0);
                            if (master_socket < 0) {
                                perror("socket");
                                ESP_LOGE(TAG, "... Failed to allocate socket errno=%d", errno);
                                vTaskDelay(1000 / portTICK_PERIOD_MS);
                            } else {
                                ESP_LOGE(TAG, "... Allocated socket...");
                                socket_client_status = allocated_socket;
                            }
                            break;
                        case allocated_socket:
                            setsockopt(master_socket, SOL_SOCKET, SO_REUSEADDR, ( void * ) &xTrueValue, sizeof( xTrueValue ));
                            if (bind(master_socket, (struct sockaddr *) &tcpServerAddr, sizeof(tcpServerAddr)) != 0) {
                                socket_client_status = idle;
                                perror("bind");
                                ESP_LOGE(TAG, "... socket bind failed errno=%d ...", errno);
                                shutdown(master_socket,0);
                                close(master_socket);
                                vTaskDelay(1000 / portTICK_PERIOD_MS);
                                if( bind_fail_cnt++ >= MAX_SOCKET_FAIL_CNT) {
                                    ESP_LOGI("TCP_SERVER","bind fails .. Restarting the system");
                                    fatal_err_handler(TCP_SERVER,BIND_FAILS);
                                }
                            } else {
                                ESP_LOGI(TAG, "Socket bind successfull...");
                                socket_client_status = bind_socket;
                            }
                            break;
                        case bind_socket:
                            if (listen(master_socket, 3) != 0) {
                                perror("listen");
                                ESP_LOGE(TAG, "... socket listen failed errno=%d ", errno);
                                shutdown(master_socket,0);
                                close(master_socket);
                                master_socket = 0;
                                vTaskDelay(1000 / portTICK_PERIOD_MS);
                                socket_client_status = idle;
                                if( listen_fail_cnt++ >= MAX_SOCKET_FAIL_CNT) {
                                    ESP_LOGI("TCP_SERVER","listen fails .. Restarting the system");
                                    fatal_err_handler(TCP_SERVER,LISTEN_FAILS);
                                }
                            } else {
                                ESP_LOGI(TAG, "Socket listening with backlog 3");
                                socket_client_status = listen_socket;
                            }
                            break;
                        case listen_socket:
#ifndef HACK_FOR_WINDOWS_TOOL
                            client_socket = 0;
#endif
                            ESP_LOGI(TAG, "Waiting for new socket connection ...");
                            //clear the socket set
                            FD_ZERO(&readfds);

                            //add master socket to set
                            struct timeval tv;

                            /* Wait up to five seconds. */
                            tv.tv_sec = 5;
                            tv.tv_usec = 0;
                            
                            FD_CLR(master_socket, &readfds);
                            FD_SET(master_socket, &readfds);
                            max_sd = master_socket;
                            sd = client_socket;
                            //if valid socket descriptor then add to read list
                            if(sd > 0) {
                                FD_CLR( sd, &readfds);
                                FD_SET( sd , &readfds);
                            }

                            //highest file descriptor number, need it for the select function
                            if(sd > max_sd) {
                                max_sd = sd;
                            }

                            //wait for an activity on one of the sockets , timeout is 5 sec
                            activity = select( max_sd + 1 , &readfds , NULL , NULL , &tv);

