NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_socket.c
                            if ((activity < 0) && (errno!=EINTR))
                            {
                                ESP_LOGI(TAG, "select error");
                                socket_client_status = bind_socket;
                                if(select_err_cnt++ >= MAX_SOCKET_FAIL_CNT) {
                                    ESP_LOGI("TCP_SERVER","select fails .. Restarting the system");
                                    fatal_err_handler(TCP_SERVER,SELECT_FAILS);
                                }
                            }
                            //If something happened on the master socket ,
                            //then its an incoming connection
                            if (FD_ISSET(master_socket, &readfds))
                            {
                                client_socket = accept(master_socket, (struct sockaddr *) &remote_addr, &socklen);
                                if(client_socket < 0) {
                                    perror("accept");
                                    shutdown(client_socket,0);
                                    close(client_socket);
                                    client_socket = 0;
                                    ESP_LOGI("TCP_SERVER","accept fails .. Restarting the system");
                                    fatal_err_handler(TCP_SERVER,ACCEPT_FAILS);
                                } else {
#if USE_KEEP_ALIVE
                                    // Set tcp keepalive option
                                    setsockopt(client_socket, SOL_SOCKET, SO_KEEPALIVE, &keepAlive, sizeof(int));
                                    setsockopt(client_socket, IPPROTO_TCP, TCP_KEEPIDLE, &keepIdle, sizeof(int));
                                    setsockopt(client_socket, IPPROTO_TCP, TCP_KEEPINTVL, &keepInterval, sizeof(int));
                                    setsockopt(client_socket, IPPROTO_TCP, TCP_KEEPCNT, &keepCount, sizeof(int));
#endif

                                    ESP_LOGI(TAG, "New connection request from : %s:%d",
                                            inet_ntoa(remote_addr.sin_addr.s_addr),
                                            ntohs(remote_addr.sin_port));

                                    //fcntl(client_socket, F_SETFL, O_NONBLOCK);
                                   socket_client_status = connected_socket;
                                }
                            } else { //else its some IO operation on some other socket
                                sd = client_socket;
                                if (FD_ISSET( sd , &readfds))
                                {
                                    //Check if it was for closing , and also read the
                                    //incoming message
                                    memset(recv_buf,0, sizeof(recv_buf));
                                    //valread = read( sd , recv_buf, sizeof(recv_buf) - 1);
                                    valread = recv( client_socket , recv_buf, sizeof(recv_buf) - 1,0);
                                    if (valread  == 0)
                                    {
                                        //Somebody disconnected , get his details and print
                                        getpeername(client_socket , (struct sockaddr*)&remote_addr , \
                                                (socklen_t*)&socklen);
                                        ESP_LOGI(TAG, "Client disconnected , ip %s , port %d \n" ,
                                                inet_ntoa(remote_addr.sin_addr) , ntohs(remote_addr.sin_port));
                                        //Close the socket and mark as 0 in list for reuse
                                        shutdown(client_socket,0);
                                        close( client_socket );
                                        sd = 0;
                                        client_socket = 0;
#if 0
                                        //Close the socket and mark as 0 in list for reuse
                                        shutdown(client_socket,0);
                                        close( client_socket );
                                        client_socket = 0;
                                        socket_client_status = bind_socket;
#endif
                                    } else if (valread < 0) {
                                        perror("recv");
                                        sd = 0;
                                        shutdown(client_socket,0);
                                        close(client_socket);
                                        client_socket = 0;
#if 0
                                        shutdown(client_socket,0);
                                        close(client_socket);
                                        client_socket = 0;
                                        socket_client_status = bind_socket;
#endif
                                    } else {
                                        ESP_LOGI(TAG, "Checking data :: recv_buf[0]: %02X", recv_buf[0]);
                                        if (read_calib_config_req(&uart_cmd, stream_tx_buff, &total_req_len)) {
                                            socket_client_status = data_received;
                                            ESP_LOGI(TAG, "Data received.");
                                            extern uint8_t configuration_timeout_cnt;
                                            configuration_timeout_cnt = 0;
                                        }
                                    }

                                }
#ifndef HACK_FOR_WINDOWS_TOOL
                                shutdown(client_socket,2);
                                close(client_socket);
                                client_socket = 0;
#endif
                            }
                            break;
                        case connected_socket:
                            memset(recv_buf,0, sizeof(recv_buf));
                            r = recv(client_socket, recv_buf, sizeof(recv_buf) - 1, 0);

                            if (r == 0) {
                                ESP_LOGI(TAG, "Client disconnected");
                                shutdown(client_socket,0);
                                close(client_socket);
                                client_socket = 0;
                                //socket_client_status = bind_socket;
                            } else if (r < 0) {
                                perror("recv");
                                ESP_LOGI(TAG, "Read error: (%d)" , r);
                                shutdown(client_socket,0);
                                close(client_socket);
                                client_socket = 0;
                                //socket_client_status = bind_socket;
                            } else {
                                ESP_LOGI(TAG, "Checking data : recv_buf[0]: %02X", recv_buf[0]);
                                if (read_calib_config_req(&uart_cmd, stream_tx_buff, &total_req_len)) {
                                    socket_client_status = data_received;
                                    ESP_LOGI(TAG, "Data received");
                                    extern uint8_t configuration_timeout_cnt;
                                    configuration_timeout_cnt = 0;
                                }
                            }
                            break;
                        case data_received:
                            process_labview_cmd();
                            /* Close the client socket connection */
#ifdef HACK_FOR_WINDOWS_TOOL
                            /* 
                             *To support both windows and mobile app can't close every time
                             * Hence max open socket count reaches a max count closing the sockets
                             * Improper way, but no other choice. God bless
                             */
                            client_socket_id[open_socket_cnt] = client_socket;
                            open_socket_cnt++;
                            if(open_socket_cnt > MAX_ALLOWED_OPEN_SOCKETS) {
                                for(i=0; i < MAX_ALLOWED_OPEN_SOCKETS; i++) {
                                    shutdown(client_socket_id[i],0);
                                    close(client_socket_id[i]);
                                    client_socket_id[i] = 0;
                                    vTaskDelay(100/portTICK_PERIOD_MS);
                                }
                                client_socket = 0;
                                open_socket_cnt = 0;
                            }
#else 
                                shutdown(client_socket,0);
                                close(client_socket);
                                client_socket = 0;
#endif
                            socket_client_status = listen_socket;
                            break;
                        case do_nothing:
                            break;
                    }
                } else {
                    ready_to_be_exited = 1;
                    while(1) {
                        vTaskDelay(10/portTICK_PERIOD_MS);
                    }
                }
            }
        }
    }
}

