NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_socket.c
/*
 * @Info:   General CRC16 calculation
 * @Param:  Data buffer and length of the data buffer
 * @Return: crc16
 */
uint16_t crc_16(uint8_t *data_p, uint16_t length) {
    uint8_t i;
    uint16_t data;
    uint16_t crc = 0xffff;
    if (length == 0) {
        return (~crc);
    }
    do {
        for (i = 0, data = ((uint16_t) 0xff & *data_p++);
             i < 8;
             i++, data >>= 1) {
            if ((crc & 0x0001) ^ (data & 0x0001))
                crc = (crc >> 1) ^ POLY;
            else
                crc >>= 1;
        }
    } while (--length);
    crc = ~crc;
    data = crc;
    crc = ((crc << 8) | ((data >> 8) & 0xff));
    return (crc);
}

/*
 * @Info:   Parse incoming data from the tool
 * @Param:  None
 * @Return: None
 */

uint8_t read_calib_config_req(uint8_t *req_cmd, uint8_t *req_payload, uint16_t *req_pkt_len) {
    uint8_t _sync_word, buff_idx;
    uint16_t _full_pkt_len, _check_sum, _calc_check_sum;
    /* Extract the sync word from the received buffer */
    _sync_word = recv_buf[0];
    if (_sync_word == CONFIG_CALIB_SYNC) {
        for (buff_idx = 0; buff_idx < REQ_HEADER_LEN; buff_idx++) {
            /* Since sync word is already extracted copy the bytes starting from command into the rx_buffer */
            stream_rx_buff[buff_idx] = recv_buf[buff_idx + 1];
        }
        *req_cmd = stream_rx_buff[REQ_ID_IDX];
        *req_pkt_len = ((stream_rx_buff[REQ_DAT_LEN_IDX + 1] << 8) | (stream_rx_buff[REQ_DAT_LEN_IDX]));
        memcpy((uint8_t * ) & config_calib_ses_res, &stream_rx_buff[REQ_SES_ID_IDX], SES_ID_LEN);
        if (*req_pkt_len > MAX_PAYLOAD_LEN) {
            ESP_LOGI(TAG, "Payload greater than maximum length");
            return 0;
        }
        _full_pkt_len = *req_pkt_len + REQ_HEADER_LEN + REQ_CRC_LEN;

        for (buff_idx = REQ_PAYLOAD_IDX; buff_idx < _full_pkt_len; buff_idx++) {
            stream_rx_buff[buff_idx] = recv_buf[buff_idx + 1];
        }
        _full_pkt_len -= REQ_CRC_LEN;
        _calc_check_sum = crc_16(stream_rx_buff, (_full_pkt_len));
        _check_sum = ((stream_rx_buff[_full_pkt_len + 1] << 8) | stream_rx_buff[_full_pkt_len]);

        if (*req_pkt_len > 0) {
            memcpy(req_payload, &stream_rx_buff[REQ_PAYLOAD_IDX], *req_pkt_len);
        }
        ESP_LOGI(TAG, "Read calib/config returned success");
        return 1;
    }
    ESP_LOGI(TAG, "Sync word didn't match");
    return 0;

}

/*
 * @Info:   Send response to utility
 * @Param:  None
 * @Return: None
 */

void res_to_utility(uint8_t _res_type, uint8_t *_res_buff, uint16_t _res_len) {
    uint16_t _full_pkt_len, check_sum;
    uint8_t i = 0;
    if (config_calib_mode == CONFIG_CALIB_WIFI_CLIENT) {
        ESP_LOGI(TAG, "Response to utility as a client");
        stream_tx_buff[RES_SYNC_IDX] = CONFIG_CALIB_SYNC;
        stream_tx_buff[REQ_SES_ID_IDX] = _res_type;
        stream_tx_buff[RES_DAT_LEN_IDX] = (_res_len & 0xFF);
        stream_tx_buff[RES_DAT_LEN_IDX + 1] = ((_res_len >> 8) & 0xFF);
        memcpy((uint8_t * ) & stream_tx_buff[RES_SSID_IDX], &config_calib_ses_res, SES_ID_LEN);
        if (_res_len > 0) {
            memcpy(&stream_tx_buff[RES_PAYLOAD_IDX_CLIENT], _res_buff, _res_len);
        }
        _full_pkt_len = RES_HEADER_LEN_CLIENT + _res_len;
        check_sum = crc_16(stream_tx_buff, _full_pkt_len);
        stream_tx_buff[_full_pkt_len + 1] = (check_sum >> 8);
        stream_tx_buff[_full_pkt_len] = (check_sum & 0xFF);
        _full_pkt_len += RES_CRC_LEN;
        int err = send(sock, stream_tx_buff, _full_pkt_len, 0);
        if (err < 0) {
            ESP_LOGE(TAG, "Error occurred during sending: errno %d", errno);
        }
    } else {
        ESP_LOGI(TAG, "Response to utility as a server");
        stream_tx_buff[RES_SYNC_IDX] = CONFIG_CALIB_SYNC;
        stream_tx_buff[REQ_SES_ID_IDX] = _res_type;
        stream_tx_buff[RES_DAT_LEN_IDX] = (_res_len & 0xFF);
        stream_tx_buff[RES_DAT_LEN_IDX + 1] = ((_res_len >> 8) & 0xFF);
        if (_res_len > 0) {
            memcpy(&stream_tx_buff[RES_PAYLOAD_IDX], _res_buff, _res_len);
        }
        _full_pkt_len = RES_HEADER_LEN + _res_len;
        check_sum = crc_16(stream_tx_buff, _full_pkt_len);
        stream_tx_buff[_full_pkt_len + 1] = (check_sum >> 8);
        stream_tx_buff[_full_pkt_len] = (check_sum & 0xFF);
        _full_pkt_len += RES_CRC_LEN;
        // Sometimes device not able to capture the packet.
        // Hence trying 5 retries
        //for(i = 0; i < 5; i++) { // WINDOWS HACK
            int err = write(client_socket, stream_tx_buff, _full_pkt_len);
            if (err < 0) {
                perror("write");
                ESP_LOGE(TAG, "Error occurred during sending %s: errno %d", __func__,errno);
            }
            vTaskDelay(10/portTICK_PERIOD_MS);
        //}
    }
    beep(1, SHORT_BEEP);
}

/*
 * @Info:   Send response to utility for authentication
 * @Param:  None
 * @Return: None
 */
void
send_con_res_config_calib() {
    extern uint8_t dev_type;
    if ((i2c_eeprom_read_int32(EE_CALIB_DONE_ADDR) == CALIB_CONFIG_DONE_VALUE)) {
        stream_rx_buff[CON_RES_FLAG_IDX] = 1;
    } else {
        stream_rx_buff[CON_RES_FLAG_IDX] = 0;
    }
    i2c_eeprom_read_buff(EE_DEV_SER_NO_ADDR, &stream_rx_buff[CON_RES_ID_IDX], (DEV_SER_NO_LEN + DEVICE_TYPE_LEN));
    memcpy(&stream_rx_buff[CON_RES_ID_IDX + DEV_SER_NO_LEN], &dev_type, DEVICE_TYPE_LEN);
    memcpy(&stream_rx_buff[CON_RES_HW_VER_IDX], (uint8_t * ) & turt_fm_hw_ver, HW_FM_VER_LEN);
    stream_rx_buff[CON_RES_PROT_VER_IDX] = CALIB_CONFIG_MAJ_VER;
    stream_rx_buff[CON_RES_PROT_VER_IDX + 1] = CALIB_CONFIG_MIN_VER;
    memcpy(&stream_rx_buff[CON_RES_SID_IDX], (uint8_t * ) & config_calib_ses_id, SES_ID_LEN);
    res_to_utility(REQ_CON, stream_rx_buff, CON_RES_PKT_LEN);
}

/*
 * @info:   Read digital value from the device
 * @Param:  None
 * @Return: None
 */
void read_send_adc_value() {
    read_adc_all(stream_rx_buff);
    res_to_utility(CMD_GET_ADC, stream_rx_buff, 20 + 8);
}

