NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_socket.c
/*
 * @Info:   Read values from EEPROM
 * @Param:  None
 * @Return: None
 */
void read_send_eeprom_val() {
    uint16_t _ee_start_address;
    uint8_t _ee_dat_len;
    memcpy((uint8_t * ) & _ee_start_address, &stream_tx_buff[0], 2);
    _ee_dat_len = stream_tx_buff[2];
    if ((_ee_dat_len > 0) && (_ee_dat_len <= MAX_PAYLOAD_LEN)) {
        memcpy(&stream_rx_buff[0], (uint8_t * ) & _ee_start_address, 2);
        stream_rx_buff[2] = _ee_dat_len;
        i2c_eeprom_read_buff(_ee_start_address, &stream_rx_buff[3], _ee_dat_len);
        res_to_utility(CMD_READ_EEPROM, stream_rx_buff, (_ee_dat_len + 3));
    }
    if (_ee_start_address >= 0xFF21) {
        clear_system_flag(SF_USEABLE_SOC_RC);
    }
}

/*
 * @Info:   Load WiFi parameters
 * @Param:  SSID and PSW
 * @Return: None
 */
void load_wifi_param() {
    i2c_eeprom_read_buff(64672, https_password, SERV_IP_LEN);
    // server_port_address = i2c_eeprom_read_int16(EE_SERV_PORT_ADDR);
    i2c_eeprom_read_buff(EE_AP_SSID_ADDR, ap_ssid_buff, AP_SSID_LEN);
    i2c_eeprom_read_buff(EE_AP_PSW_ADDR, ap_psw_buff, AP_PSW_LEN);
    https_password[SERV_IP_LEN - 1] = '\0';
    ap_ssid_buff[AP_SSID_LEN - 1] = '\0';
    ap_psw_buff[AP_PSW_LEN - 1] = '\0';
    access_point = primary;
    ESP_LOGI(TAG, "HTTP password at 0xFCA0- %s\n", (char *) https_password);

    uint8_t https_FC_password[SERV_IP_LEN];
    i2c_eeprom_read_buff(0xFC00, https_FC_password, SERV_IP_LEN);
    ESP_LOGI(TAG, "HTTP password at 0xFC00 - %s\n", (char *) https_FC_password);
}

/*
 * @Info:   Calcualte CRC for data to be stored in EEPROM
 * @Param:  Memory starting address, Total length, memory location to store CRC
 * @Return: CRC16
 */
uint16_t calc_update_eeprom_crc(uint16_t _ee_start_address, uint8_t _ee_len, uint16_t _crc_addr, uint8_t is_update) {
    uint16_t _ee_crc = 0;
    vTaskDelay(100 / portTICK_RATE_MS);
    i2c_eeprom_read_buff(_ee_start_address, stream_rx_buff, _ee_len);
    _ee_crc = crc_16(stream_rx_buff, _ee_len);
    if (is_update) {
        vTaskDelay(100 / portTICK_RATE_MS);
        ESP_LOGI("EEPROM_WRITE", "WRITING INTO EE_CONFIG/CALIB_CRC_ADDR WITH CRC : %04X",_ee_crc);
        i2c_eeprom_write_int16(_crc_addr, _ee_crc);
    }
    return (_ee_crc);
}

/*
 * @Info:   Write data into EEPROM
 * @param:  None
 * @Return: None
 */
void write_const_to_eeprom() {
    uint16_t _ee_start_address, _ee_end_address;
    uint8_t _ee_dat_len;
    memcpy((uint8_t * ) & _ee_start_address, &stream_tx_buff[0], 2);
    _ee_dat_len = stream_tx_buff[2];
    _ee_end_address = (_ee_start_address + _ee_dat_len) - 1;

    if ((_ee_dat_len > 0) && (_ee_dat_len <= MAX_PAYLOAD_LEN) &&
        (_ee_start_address >= EE_CONFIG_DAT_START_ADDR && _ee_end_address <= EE_SYS_THR_END_ADDR)) {
        i2c_eeprom_write_buff(_ee_start_address, &stream_tx_buff[3], _ee_dat_len);
        ESP_LOGI(TAG, "%d written into EEPROM", _ee_dat_len);
        vTaskDelay(20 / portTICK_RATE_MS);
        memcpy(&stream_rx_buff[0], (uint8_t * ) & _ee_start_address, 2);
        stream_rx_buff[2] = _ee_dat_len;
        i2c_eeprom_read_buff(_ee_start_address, &stream_rx_buff[3], _ee_dat_len);
#if 0
        for (int i = 0; i < _ee_dat_len; i++) {
            ESP_LOGI(TAG, "Element %d in data is %d", i, stream_rx_buff[i]);
        }
#endif
        ESP_LOGI(TAG, "Preparing response to utility");
        res_to_utility(CMD_WRITE_EEPROM, stream_rx_buff, (_ee_dat_len + 3));
        beep(1, SHORT_BEEP);
    }

    vTaskDelay(100 / portTICK_RATE_MS);
    if (_ee_start_address >= EE_CONFIG_DAT_START_ADDR && _ee_end_address < EE_DC_OVER_I_THR_ADDR) {
        ESP_LOGI("EEPROM_WRITE", "WRITING INTO EE_CONFIG_DONE_ADDR");
        i2c_eeprom_write_int32(EE_CONFIG_DONE_ADDR, CALIB_CONFIG_DONE_VALUE);
        ESP_LOGI(TAG, "Configuration done address");
        vTaskDelay(100 / portTICK_RATE_MS);
    }

    if (_ee_start_address >= EE_DC_OVER_I_THR_ADDR && _ee_end_address < EE_CONFIG_DONE_ADDR) {
        ESP_LOGI("EEPROM_WRITE", "WRITING INTO EE_CONFIG_DONE_ADDR - DEBUG 2");
        i2c_eeprom_write_int32(EE_CONFIG_DONE_ADDR, CALIB_CONFIG_DONE_VALUE);
        vTaskDelay(100 / portTICK_RATE_MS);
        clear_error(ERR_NOT_CONFIG);
        ESP_LOGI(TAG, "Clear configuration error");
    }

    if (_ee_start_address >= EE_CONFIG_DAT_START_ADDR && _ee_end_address < EE_CONFIG_DONE_ADDR) {
        ESP_LOGI("EEPROM_WRITE", "WRITING INTO EE_CONFIG_CRC_ADDR");
        calc_update_eeprom_crc(EE_CONFIG_DAT_START_ADDR, CONFIG_PARAM_LEN, EE_CONFIG_CRC_ADDR, 1);
        ESP_LOGI(TAG, "Calculating CRC");
    }

    if (_ee_start_address >= EE_CALIB_DAT_START_ADDR && _ee_end_address < EE_CALIB_DONE_ADDR) {
        ESP_LOGI("EEPROM_WRITE", "WRITING INTO EE_CALIB_DONE_ADDR");
        i2c_eeprom_write_int32(EE_CALIB_DONE_ADDR, CALIB_CONFIG_DONE_VALUE);
        ESP_LOGI("EEPROM_WRITE", "WRITING INTO EE_CALIB_CRC_ADDR");
        calc_update_eeprom_crc(EE_CALIB_DAT_START_ADDR, CALIB_CONST_LEN, EE_CALIB_CRC_ADDR, 1);
        clear_error(ERR_NOT_CALIB);
        ESP_LOGI(TAG, "Calibration done address");
    }

    vTaskDelay(100 / portTICK_RATE_MS);
    load_sensor_constants();
    load_wifi_param();
}

/*
 * @Info:   Send analog values to utility
 * @Param:  None
 * @Return: None
 */
void send_real_values() {
    extern uint8_t mains;
    extern float inverter_vol, temperature1, temperature2, vol_ref;
    get_sensor_values(FLUSH_ADC_VAL, 0);
    memcpy(&stream_rx_buff[0], (uint8_t * ) & algo_param.cur_bat_v, 4);
    memcpy(&stream_rx_buff[4], (uint8_t * ) & algo_param.cur_chg_i, 4);
    memcpy(&stream_rx_buff[8], (uint8_t * ) & algo_param.cur_dis_i, 4);
    memcpy(&stream_rx_buff[12], (uint8_t * ) & algo_param.cur_sol_v, 4);
    memcpy(&stream_rx_buff[16], (uint8_t * ) & algo_param.cur_sol_i, 4);
    memcpy(&stream_rx_buff[20], (uint8_t * ) & algo_param.cur_ac_load_i, 4);
    memcpy(&stream_rx_buff[24], (uint8_t * ) & inverter_vol, 4);
    memcpy(&stream_rx_buff[28], (uint8_t * ) & temperature1, 4);
    memcpy(&stream_rx_buff[32], (uint8_t * ) & vol_ref, 4);
    memcpy(&stream_rx_buff[36], (uint8_t * ) & mains, 1);
    memcpy(&stream_rx_buff[37], (uint8_t * ) & temperature2, 4);
    res_to_utility(CMD_GET_REAL_VAL, stream_rx_buff, 41);
}

