NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_socket.c
/*
 * @Info:   The code is used to perform the following
 *          1. Authentication
 *          2. Set time
 *          3. Get ADC value
 *          4. Get swtich status
 *          5. Set switch status
 *          6. Test connectivity with server
 *          7. Read  from EEPROM
 *          8. Write to   EEPROM 
 *          9. Get real values
 *          10. Buzzer sound
 *          11. Exit calibration/configuration mode
 * @Param:  None
 * @Return: None
 */
void process_labview_cmd() {
    switch (uart_cmd) {
        /* Authentication */
        case REQ_CON:
            ESP_LOGI("inside_process_labview_cmd", "Authentication request command");
            send_con_res_config_calib();
            break;
            /* Get ADC value */
        case CMD_GET_ADC:
            ESP_LOGI("inside_process_labview_cmd", "Get ADC command");
            read_send_adc_value();
            break;
            /* Get the status of device state */
        case CMD_GET_SW:
            ESP_LOGI("inside_process_labview_cmd", "Get switch commmand");
            stream_rx_buff[0] = switch_state;
            res_to_utility(CMD_GET_SW, stream_rx_buff, 1);
            break;
            /* Set the state of the device */
        case CMD_SET_SW:
            ESP_LOGI("inside_process_labview_cmd", "Set switch status command");
            turtle_set_sw(stream_tx_buff[0]);
            stream_rx_buff[0] = switch_state;
            res_to_utility(CMD_SET_SW, stream_rx_buff, 1);
            break;
            /* Test connectivity */
        case CMD_TEST_CONFIG:
            ESP_LOGI("inside_process_labview_cmd", "Test configuration command");
            res_to_utility(CMD_TEST_CONFIG, stream_rx_buff, 0);
            load_wifi_param();
            xSemaphoreGive(testConnectionSemaphore);
            break;
            /* Read EEPROM */
        case CMD_READ_EEPROM:
            ESP_LOGI("inside_process_labview_cmd", "EEPROM read command");
            read_send_eeprom_val();
            break;
            /* Write EEPROM */
        case CMD_WRITE_EEPROM:
            ESP_LOGI("inside_process_labview_cmd", " EEPROM write command");
            write_const_to_eeprom();
            break;
            /* Get sensor values from device */
        case CMD_GET_REAL_VAL:
            ESP_LOGI("inside_process_labview_cmd", "Sensor value command");
            send_real_values();
            break;
        case CMD_EXIT:
            /* Exit from task */
            ESP_LOGI("inside_process_labview_cmd", "Exit command received");
            res_to_utility(CMD_EXIT, stream_rx_buff, 0);
            break;
        default:
            ESP_LOGI("inside_process_labview_cmd", "Wrong command received");
            break;
    }
}
